# Loop and Iteration for Python Programming

<b>created by</b> : Muhammad Ammar Fauzan | maf.fauzan@gmail.com

## Pengenalan Iterasi

### Definite Iteration

In [ ]:
#Concept Definite Iteration
for target in iterable:
    statement(s)

In [1]:
list_angka = [1,2,3,4,5]

for i in list_angka: #perulangan akan dilakukan sejumlah item pada variabel list_angka
    print(i)

1
2
3
4
5

In [2]:
name = 'rakamin' #string termasuk object iterable

for m in name:
    print(m)

r
a
k
a
m
i
n

In [3]:
list_angka = [1,2,3,4,5,6,7,8,9]

for i in list_angka: #perulangan akan dilakukan sejumlah item pada variabel list_angka
    print(i)

1
2
3
4
5
6
7
8
9

### Iterables

In [7]:
#cek iterable menggunakan fungsi iter()
a = iter('foobar')                             # String

b = iter(['foo', 'bar', 'baz'])                # List

c = iter(('foo', 'bar', 'baz'))                # Tuple

d = iter({'foo', 'bar', 'baz'})                # Set

e = iter({'foo': 1, 'bar': 2, 'baz': 3})       # Dict

In [8]:
print(b) #sukses menjadi object iteraror

<list_iterator object at 0x0000010A22F7FA30>

In [9]:
#memunculkan item pada variabel b one by one
print(next(b))
print(next(b))
print(next(b))

foo
bar
baz

### Range

In [3]:
#fungsi range(b) = 0 - (b-1)
for i in range(5):
    print(i)

0
1
2
3
4

In [3]:
#fungsi range(a, b) = a - (b-1)
for i in range(1, 5):
    print(i)

1
2
3
4

In [4]:
for i in range(2, 10, 2): #nilai i start dari 2 dan naik +2
    print(i)

2
4
6
8

### Kondisi dengan lebih dari 1 statement

In [4]:
#contoh 1: Membuat bilangan kuadrat dari 1-10 dan mencetak hasilnya

for i in range(1, 11):
    kuadrat = i*i #statement 1
    print('Kuadrat', i, 'adalah', kuadrat) #statement 2

Kuadrat 1 adalah 1
Kuadrat 2 adalah 4
Kuadrat 3 adalah 9
Kuadrat 4 adalah 16
Kuadrat 5 adalah 25
Kuadrat 6 adalah 36
Kuadrat 7 adalah 49
Kuadrat 8 adalah 64
Kuadrat 9 adalah 81
Kuadrat 10 adalah 100

In [4]:
#contoh 2 : Membuat nama kolom menjadi huruf kecil (lower case) dan snake case (_)

import pandas as pd

df = pd.DataFrame({'Nama Customer':['Ammar', 'Hasan'],
                  'Kota Customer':['Surabaya', 'Bandung']})
df

  Nama Customer Kota Customer
0         Ammar      Surabaya
1         Hasan       Bandung

In [5]:
column_name = df.columns
column_name

Index(['Nama Customer', 'Kota Customer'], dtype='object')

In [6]:
column_name_new = [] #list_kosong

# iterasi setiap nama column
for i in column_name:
    new_name = i.lower() #statement 1
    split_name = new_name.split() #[name1, name2] #statement 2
    new_name = split_name[0] + '_' + split_name[1] #statement 3
    column_name_new.append(new_name) #statement 4
    
print(column_name_new)

['nama_customer', 'kota_customer']

In [7]:
df.columns = column_name_new
df

  nama_customer kota_customer
0         Ammar      Surabaya
1         Hasan       Bandung

### Indefinite Iteration

In [ ]:
#contoh implementasi indefinite iteration
while expression:
    statement(s)

In [8]:
#while loop
i = 0  #initiate var
while i < 7: #expression
    print(i) #statement 1
    i+=1 #statement 2 | i=i+1

0
1
2
3
4
5
6

In [9]:
#while loop
list_number = range(7)
i = 0  #initiate var
while i < len(list_number): #expression
    print(i) #statement 1
    i+=1 #statement 2 | i=i+1

0
1
2
3
4
5
6

### Mini Quiz | Challenge Time #1

Terdapat 50 user dengan user_id berurut dari 101 - 150, kita akan memilih beberapa user_id saja yang akan dijadikan sebagai target  user interview. Kriteria user yang akan diambil adalah.

Jika nilai user_id adalah <b>bilangan kelipatan 5 yang habis dibagi 2.</b> 

Ada berapa jumlah user yang menjadi target participant? Buatlah dua versi, pertama menggunakan iterasi for dan kedua menggunakan while!

<b>Hint:</b> Buatlah variabel dengan value 0 yang terus bertambah secara incremental setiap iterasi jika memenuhi kondisi yang diminta, gunakan conditional statement - IF

In [23]:
#Challenge Time #1
#bentuk for


# print('Jumlah user_id yang sesuai ada',n_target)

In [24]:
#Challenge Time #1
#bentuk while

# print('Jumlah user_id yang sesuai ada',n_target)

## Iterasi List

Iterasi pada list berfungsi untuk melakukan perulangan terhadap setiap itemnya

In [12]:
list_nilai = [70, 72, 60, 80, 83, 90, 85, 100]

for i in list_nilai:
    cek_nilai = i > 70 #melakukan pengecekan dengan hasil boolean, i bernilai item pada list
    print(cek_nilai)

False
True
False
True
True
True
True
True

### Perulangan memunculkan index

In [10]:
#memunculkan index dengan fungsi .index()
list_nilai = [70, 72, 60, 80, 83, 90, 85, 100]

for i in list_nilai:
    print('index', list_nilai.index(i), 'adalah', i)

index 0 adalah 70
index 1 adalah 72
index 2 adalah 60
index 3 adalah 80
index 4 adalah 83
index 5 adalah 90
index 6 adalah 85
index 7 adalah 100

In [11]:
#memunculkan index dengan fungsi .index()
list_nilai = [70, 72, 60, 80, 83, 90, 85, 100, 12]

for i in list_nilai:
    print('index', list_nilai.index(i), 'adalah', i)

index 0 adalah 70
index 1 adalah 72
index 2 adalah 60
index 3 adalah 80
index 4 adalah 83
index 5 adalah 90
index 6 adalah 85
index 7 adalah 100
index 8 adalah 12

In [10]:
#memunculkan index dengan fungsi .index()
list_nilai = [70, 72, 60, 80, 83, 90, 85, 100, 12, 72]

In [13]:
for i, x in enumerate(list_nilai):
    print('index', i, 'adalah', x)

index 0 adalah 70
index 1 adalah 72
index 2 adalah 60
index 3 adalah 80
index 4 adalah 83
index 5 adalah 90
index 6 adalah 85
index 7 adalah 100
index 8 adalah 12
index 9 adalah 72

In [11]:
for index, value in enumerate(list_nilai):
    print('index', index, 'adalah', value)

index 0 adalah 70
index 1 adalah 72
index 2 adalah 60
index 3 adalah 80
index 4 adalah 83
index 5 adalah 90
index 6 adalah 85
index 7 adalah 100
index 8 adalah 12
index 9 adalah 72

In [15]:
#penjelasan multiple dimensi
contoh_multiple_dimensi = [['Ammar', 'Badminton'], ['Ahmad', 'Membaca']] #list di dalam list

for nama, hobi in contoh_multiple_dimensi:
    print("Namanya adalah", nama, 'memiliki hobi', hobi)

Namanya adalah Ammar memiliki hobi Badminton
Namanya adalah Ahmad memiliki hobi Membaca

### Membuat list baru dari hasil perulangan

In [16]:
#Studi kasus: membuat list baru yang merupakan status hasil ujian

list_nilai = [70, 72, 60, 80, 83, 90, 85, 100]
status = [] #list kosong

for i in list_nilai:
    if i > 75:
        status.append('Lulus')
    else:
        status.append('Tidak Lulus')
        
status

['Tidak Lulus',
 'Tidak Lulus',
 'Tidak Lulus',
 'Lulus',
 'Lulus',
 'Lulus',
 'Lulus',
 'Lulus']

### One Liner | List Comprehension

In [12]:
#One liner | list comprehension
list_nilai = [70, 72, 60, 80, 83, 90, 85, 100]

basic = [i for i in list_nilai]
basic

[70, 72, 60, 80, 83, 90, 85, 100]

In [18]:
#One liner | list comprehension
list_nilai = [70, 72, 60, 80, 83, 90, 85, 100]

status = [i for i in list_nilai]
status

[70, 72, 60, 80, 83, 90, 85, 100]

In [19]:
#One liner | list comprehension
list_nilai = [70, 72, 60, 80, 83, 90, 85, 100]

status = ['Lulus' if i > 75 else 'Tidak Lulus' for i in list_nilai]
status

['Tidak Lulus',
 'Tidak Lulus',
 'Tidak Lulus',
 'Lulus',
 'Lulus',
 'Lulus',
 'Lulus',
 'Lulus']

In [13]:
#One liner | list comprehension (mengambil sebagian)
list_angka = [1,2,3,4,5,6,7,8,9,10, 12, 13, 15, 18]

list_genap = [i for i in list_angka if i%2 == 0]
list_genap

[2, 4, 6, 8, 10, 12, 18]

In [21]:
#One liner | list comprehension (mengambil sebagian)
list_angka = [1,2,3,4,5,6,7,8,9,10]

list_genap = [i for i in list_angka if i%2 != 0]
list_genap

[1, 3, 5, 7, 9]

### Iterasi di dalam iterasi pada konteks List

In [23]:
list_category = ['Fashion', 'Makanan', 'Handphone', 'Sepeda', 'Rumah Tangga']
bundling_list = []

for i in list_category:
    category1 = i #category pertama
    for y in list_category:
        if i != y: #pengecekan beda category
            category2 = y #category kedua
            bundling = i + '-' +y
            bundling_list.append(bundling)
        
bundling_list

['Fashion-Makanan',
 'Fashion-Handphone',
 'Fashion-Sepeda',
 'Fashion-Rumah Tangga',
 'Makanan-Fashion',
 'Makanan-Handphone',
 'Makanan-Sepeda',
 'Makanan-Rumah Tangga',
 'Handphone-Fashion',
 'Handphone-Makanan',
 'Handphone-Sepeda',
 'Handphone-Rumah Tangga',
 'Sepeda-Fashion',
 'Sepeda-Makanan',
 'Sepeda-Handphone',
 'Sepeda-Rumah Tangga',
 'Rumah Tangga-Fashion',
 'Rumah Tangga-Makanan',
 'Rumah Tangga-Handphone',
 'Rumah Tangga-Sepeda']

### While Loop pada List

In [14]:
list_angka = [1,2,3,4,5,6,7,8,9,10]

i = 0 #initiate variable
while i < len(list_angka):
    print(list_angka[i])
    i += 1

1
2
3
4
5
6
7
8
9
10

In [1]:
list_category = ['Fashion', 'Buku', 'Makanan', 'Sepeda', 'Komputer']

i = 0 #initiate
while i < len(list_category):
    print(list_category[i])
    i += 1 # i=i+1

Fashion
Buku
Makanan
Sepeda
Komputer

### Mini Quiz | Challenge Time #2

Berikut adalah list total order customer Rakamin Store <br>

list_total_order = [10, 2, 18, 30, 56, 12, 8, 20, 45, 60, 10, 23, 3]

Tentukan ada berapa banyak customer yang memiliki nilai order diatas rata-rata customer Rakamin Store! Gunakan cara for atau while

In [25]:
#Challenge Time #2
list_total_order = [10, 2, 18, 30, 56, 12, 8, 20, 45, 60, 10, 23, 3]
    
# print('Total Customer lebih dari rata2 adalah',n_fit)

## Iterasi Dictionary

### Memanggil key pada Dictionary

In [28]:
seller_kategori = {'sellerA':['Fashion'],
                  'sellerB':['Fashion', 'Elektronik'],
                  'sellerC':['Perabotan', 'Buku'],
                  'sellerD':['Elektronik'],
                  'sellerE':['Fashion'],
                  'sellerF':['Perabotan', 'Elektronik']}

for i in seller_kategori:
    print(i) #key pada dictionary

sellerA
sellerB
sellerC
sellerD
sellerE
sellerF

### Memanggil value pada Dictionary

In [29]:
for i in seller_kategori:
    print(seller_kategori[i])

['Fashion']
['Fashion', 'Elektronik']
['Perabotan', 'Buku']
['Elektronik']
['Fashion']
['Perabotan', 'Elektronik']

### Memanggil key dan value sekaligus pada Dictionary

In [30]:
# memanggil key dan value sekaligus
for i in seller_kategori.items():
    print(i) #berupa tuple

('sellerA', ['Fashion'])
('sellerB', ['Fashion', 'Elektronik'])
('sellerC', ['Perabotan', 'Buku'])
('sellerD', ['Elektronik'])
('sellerE', ['Fashion'])
('sellerF', ['Perabotan', 'Elektronik'])

In [31]:
# memanggil key dan value sekaligus
for key, value in seller_kategori.items():
    print('Nilai Key', key, 'dan value adalah', value) #berupa tuple

Nilai Key sellerA dan value adalah ['Fashion']
Nilai Key sellerB dan value adalah ['Fashion', 'Elektronik']
Nilai Key sellerC dan value adalah ['Perabotan', 'Buku']
Nilai Key sellerD dan value adalah ['Elektronik']
Nilai Key sellerE dan value adalah ['Fashion']
Nilai Key sellerF dan value adalah ['Perabotan', 'Elektronik']

### Membuat Dictionary Baru pada For Loop

In [32]:
new_dict = {} #membuat dict kosong

for key, value in seller_kategori.items():
    if 'Perabotan' in value: #check
        new_dict.update({key:value}) #menggunakan fungsi update
        
print(new_dict)

{'sellerC': ['Perabotan', 'Buku'], 'sellerF': ['Perabotan', 'Elektronik']}

### Mini Quiz | Challenge Time #3

Dari dictionary seller_kategori, buatlah variable dictionary baru (new_seller) yang hanya berisi seller yang menjual <b>produk kategori fashion!

In [26]:
#challenge Time #3
seller_kategori = {'sellerA':['Fashion'],
                  'sellerB':['Fashion', 'Elektronik'],
                  'sellerC':['Perabotan', 'Buku'],
                  'sellerD':['Elektronik'],
                  'sellerE':['Fashion'],
                  'sellerF':['Perabotan', 'Elektronik']}

# print(new_seller)

## Iterasi Dataframe

In [34]:
import pandas as pd
pd.options.display.float_format = '{:,.0f}'.format #formating float

df = pd.read_csv('monthly_rakamin_customer_order.csv')
df.tail()

,order_month,full_name,user_id,phone,city,province,email,total_order,total_gmv,total_visit
332,2022-06-01,Faruq Adi,10000030,628567812319,Makassar,Sulawesi Selatan,faruq@yahoo.com,201,5490000,773
333,2022-06-01,Abrar Adi,10000053,628223411218,Surabaya,Jawa Timur,abrar.adi@yahoo.co.id,110,2987500,276
334,2022-06-01,Johan Imawan,10000054,628223412323,Balikpapan,Kalimantan Timur,johan.imawan@yahoo.com,95,2705000,258
335,2022-06-01,Muhammad Ammar,10000055,628223412111,Surabaya,Jawa Timur,muh.ammar@gmail.com,30,760000,103
336,2022-05-01,Dodo Putro Aji,10000023,628567812312,Surabaya,Jawa Timur,dodo@gmail.com,15,605000,83

### Iterasi kolom pada dataframe

In [35]:
#mendapatkan nama kolom 
for i in df:
    print(i) #nilai i = nama kolom

order_month
full_name
user_id
phone
city
province
email
total_order
total_gmv
total_visit

### Iterasi value pada suatu kolom dataframe

In [36]:
#mendapatkan nilai setiap baris pada suatu kolom tertentu
for i in df[:10]['full_name']: #dibatasi 10 teratas saja sebagai contoh
    print(i) #nilai i = full name setiap baris

Ahmad Budiman
Azzam Haqq
Amrina Putri
Aan Utama
Adam Adi
Budi Utomo
Bayu Aji
Bila Syahputri
Chika Ayu
Cantika Putri Rahayu

### Iterasi value beberapa kolom beserta index

In [37]:
for index, kolom in df[:10].iterrows(): #dibatasi 10 teratas saja sebagai contoh
    user_id = kolom['user_id'] #mendapatkan value kolom user_id
    kota = kolom['city'] #mendapatkan value kolom city
    print(index, user_id, kota)

0 10000011 Jakarta Pusat
1 10000012 Surabaya
2 10000013 Jakarta Pusat
3 10000014 Medan
4 10000015 Jakarta Timur
5 10000016 Bandung
6 10000017 Semarang
7 10000018 Bandung
8 10000019 Semarang
9 10000020 Bandung

### Membuat kolom baru dengan iterasi dataframe

In [38]:
#membuat sebuah list kosong
provider_list = []

#iterasi dataframe dengan iterrows
for index, kolom in df.iterrows():
    prefix = str(kolom['phone'])[:5] #get prefix
    
    #conditional statement
    if prefix == '62878':
        provider = 'XL'
    elif prefix == '62856':
        provider = 'Indosat'
    elif prefix == '62822':
        provider = 'Telkomsel'
    elif prefix == '62896':
        provider = 'Theree'
    else:
        provider = 'Others'
        
    #append setiap iterasi nilai provider
    provider_list.append(provider)
    
#menginisiasi kolom baru
df['provider_phone'] = provider_list

#show data frame
df[7: 14]

,order_month,full_name,user_id,phone,city,province,email,total_order,total_gmv,total_visit,provider_phone
7,2018-02-01,Bila Syahputri,10000018,628785222218,Bandung,Jawa Barat,bila@yahoo.com,195,5362500,550,XL
8,2018-02-01,Chika Ayu,10000019,628785222219,Semarang,Jawa Tengah,chika@gmail.com,146,4015000,283,XL
9,2018-02-01,Cantika Putri Rahayu,10000020,628785222220,Bandung,Jawa Barat,cantika@gmail.co.id,21,577500,64,XL
10,2018-02-01,Dimas Aji,10000021,628785222221,Semarang,Jawa Tengah,dimas@yahoo.co.id,153,4207500,609,XL
11,2018-02-01,Dika Mulya,10000022,628567812311,Palembang,Sumatra Selatan,dika@yahoo.com,88,2420000,294,Indosat
12,2018-03-01,Dodo Putro Aji,10000023,628567812312,Surabaya,Jawa Timur,dodo@gmail.com,186,5115000,731,Indosat
13,2018-03-01,Dina Ayu,10000024,628567812313,Palembang,Sumatra Selatan,dina@gmail.co.id,35,962500,63,Indosat

In [45]:
import glob
import pandas as pd

# get file name with start with customer_rakamin_week
files = glob.glob("customer_rakamin_week*")
print(files)

['customer_rakamin_week1.csv', 'customer_rakamin_week2.csv', 'customer_rakamin_week3.csv']

In [48]:
df_all = pd.DataFrame() #dataframe kosong

for i in files:
    df_read = pd.read_csv(i) #read csv setiap file
    df_all = df_all.append(df_read) #append

In [49]:
df_all

   week       province  total_order
0     1    DKI Jakarta         1200
1     1         Banten          900
2     1     Jawa Barat         1050
3     1    Jawa Tengah          850
4     1  DI Yogyakarta          450
5     1     Jawa Timur         2000
0     2    DKI Jakarta          950
1     2         Banten          650
2     2     Jawa Barat          800
3     2    Jawa Tengah          600
4     2  DI Yogyakarta          200
5     2     Jawa Timur         1750
6     2  Sumatra Barat          170
0     3    DKI Jakarta          995
1     3         Banten          695
2     3     Jawa Barat          845
3     3    Jawa Tengah          575
4     3  DI Yogyakarta          245
5     3     Jawa Timur         1725
6     3  Sumatra Barat          215
7     3           Bali          860

### Mini Quiz | Challenge Time #4

Gunakan dataset <b>monthly_rakamin_customer_order!</b> Team bisnis memiliki rule, jika dalam sebulan

- Total order bulanan customer > rata-rata total order bulanan semua customer di bulan tersebut (mean Order customer monthly)
- Total GMV bulanan customer > rata-rata total GMV bulanan semua customer di bulan tersebut (mean GMV customer monthly)

Maka keputusan bisnisnya user eligible untuk diberikan voucher discount. Ada berapa user yang menjadi user eligible pada bulan Maret 2022?

<b>Hint: </b> Buat kolom mean_total_order_monthly dan mean_total_amount_monthly (Bisa dengan cara transform), kemudian lakukan iterrows

In [9]:
#Challenge Time #4

import pandas as pd
import numpy as np

pd.options.display.float_format = '{:,.0f}'.format #formating float

In [10]:
df = pd.read_csv('monthly_rakamin_customer_order.csv')
df.head()

,order_month,full_name,user_id,phone,city,province,email,total_order,total_gmv,total_visit
0,2018-01-01,Ahmad Budiman,10000011,628785222211,Jakarta Pusat,DKI Jakarta,ahmad@gmail.com,125,3490000,230
1,2018-01-01,Azzam Haqq,10000012,628785222212,Surabaya,Jawa Timur,azzam@gmail.co.id,173,4757500,304
2,2018-01-01,Amrina Putri,10000013,628785222213,Jakarta Pusat,DKI Jakarta,amrina@yahoo.co.id,20,550000,62
3,2018-01-01,Aan Utama,10000014,628785222214,Medan,Sumatra Utara,aan@yahoo.com,18,495000,100
4,2018-01-01,Adam Adi,10000015,628785222215,Jakarta Timur,DKI Jakarta,adam@gmail.com,159,4372500,524

## Tetap Semangat Belajar Python. Thank You!